import fs, { promises } from 'fs'
import fetch from 'node-fetch'
let handler = async (m, { conn, usedPrefix, command }) => {
try {
let d = new Date(new Date + 3600000)
let locale = 'es'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = conn.getName(m.sender)
let user = global.db.data.users[m.sender]
let fkontak = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
let menu = `
⭐¡Hola! @${m.sender.split("@")[0]}
 \`\`\`${week}, ${date}\`\`\`
 
𝙈𝙐𝘾𝙃𝙊 𝙂𝙐𝙎𝙏𝙊 𝙎𝙊𝙔 𝙀𝙇𝙄𝙏𝙀 𝘽𝙊𝙏 𝙂𝙇𝙊𝘽𝘼𝙇, 𝙔 𝙀𝙎𝙏𝙊𝙔 𝘼𝙌𝙐𝙄 𝙋𝘼𝙍𝘼 𝙂𝙐𝙄𝘼𝙍𝙏𝙀.
𝘾𝙊𝙈𝙀𝙉𝙕𝙀𝙈𝙊𝙎 ...
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙬𝙚𝙡𝙘𝙤𝙢𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘥𝘢𝘳𝘢́ 𝘭𝘢𝘴 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢𝘴 𝘦𝘯 𝘵𝘶 𝘨𝘳𝘶𝘱𝘰.

⚙️ .𝙤𝙛𝙛 𝙬𝙚𝙡𝙘𝙤𝙢𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘥𝘢𝘳𝘢́ 𝘭𝘢𝘴 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢𝘴 𝘦𝘯 𝘵𝘶 𝘨𝘳𝘶𝘱𝘰. 
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙨𝙚𝙩𝙬𝙚𝙡𝙘𝙤𝙢𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘮𝘰𝘥𝘪𝘧𝘪𝘤𝘢𝘳𝘢́𝘴 𝘭𝘢 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢 𝘦𝘯 𝘵𝘶 𝘨𝘳𝘶𝘱𝘰 .
𝘌𝘫𝘦𝘮𝘱𝘭𝘰 :
𝘉𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘰 @𝘶𝘴𝘦𝘳 𝘢𝘭 𝘨𝘳𝘶𝘱𝘰 @𝘴𝘶𝘣𝘫𝘦𝘤𝘵 , 𝘓𝘦𝘦 𝘭𝘢𝘴 𝘳𝘦𝘨𝘭𝘢𝘴 𝘥𝘦𝘭 𝘨𝘳𝘶𝘱𝘰 @𝘥𝘦𝘴𝘤.
🔗 @𝘶𝘴𝘦𝘳 (𝘔𝘦𝘯𝘤𝘪𝘰́𝘯 𝘢𝘭 𝘶𝘴𝘶𝘢𝘳𝘪𝘰(𝘢))
🔗 @𝘴𝘶𝘣𝘫𝘦𝘤𝘵 (𝘕𝘰𝘮𝘣𝘳𝘦 𝘥𝘦 𝘨𝘳𝘶𝘱𝘰)
🔗 @𝘥𝘦𝘴𝘤 (𝘋𝘦𝘴𝘤𝘳𝘪𝘱𝘵𝘪𝘰𝘯 𝘥𝘦 𝘨𝘳𝘶𝘱𝘰)

⚙️ .𝙨𝙚𝙩𝙗𝙮𝙚
𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘮𝘰𝘥𝘪𝘧𝘪𝘤𝘢𝘳𝘢́𝘴 𝘭𝘢 𝘥𝘦𝘴𝘱𝘦𝘥𝘪𝘥𝘢 𝘦𝘯 𝘵𝘶 𝘨𝘳𝘶𝘱𝘰.
𝘌𝘫𝘦𝘮𝘱𝘭𝘰 :
𝘈𝘥𝘪𝘰́𝘴 𝘲𝘶𝘦 𝘵𝘦 𝘷𝘢𝘺𝘢 𝘣𝘪𝘦𝘯 @𝘶𝘴𝘦𝘳.
*⚡ @𝘶𝘴𝘦𝘳 (𝘔𝘦𝘯𝘤𝘪𝘰́𝘯 𝘢𝘭 𝘶𝘴𝘶𝘢𝘳𝘪𝘰(𝘢))*
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙨𝙩𝙞𝙘𝙠𝙚𝙧𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘦𝘯𝘷𝘪𝘢𝘳𝘢 𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘴 𝘦𝘯 𝘧𝘰𝘳𝘮𝘢 𝘢𝘶𝘵𝘰𝘮𝘢́𝘵𝘪𝘤𝘢 𝘤𝘢𝘥𝘢 𝘷𝘦𝘻 𝘲𝘶𝘦 𝘢𝘭𝘨𝘶𝘪𝘦𝘯 𝘮𝘢𝘯𝘥𝘦𝘯 𝘢𝘭𝘨𝘶́𝘯 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 .

⚙️ .𝙤𝙛𝙛 𝙨𝙩𝙞𝙘𝙠𝙚𝙧𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘣𝘰𝘵 𝘨𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘦𝘯𝘷𝘪𝘢𝘳𝘢 𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘴.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙪𝙙𝙞𝙤𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘦𝘯𝘷𝘪𝘢𝘳𝘢 𝘢𝘶𝘥𝘪𝘰𝘴 𝘥𝘦𝘱𝘦𝘯𝘥𝘪𝘦𝘯𝘥𝘰 𝘦𝘭 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 .

⚙️ .𝙤𝙛𝙛 𝙖𝙪𝙙𝙞𝙤𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘣𝘰𝘵 𝘨𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘦𝘯𝘷𝘪𝘢𝘳𝘢 𝘢𝘶𝘥𝘪𝘰𝘴.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙢𝙤𝙙𝙤𝙝𝙤𝙧𝙣𝙮
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘭𝘰𝘴 𝘤𝘰𝘮𝘢𝘯𝘥𝘰𝘴 +18 𝘥𝘦𝘭 𝘤𝘰𝘮𝘢𝘯𝘥𝘰 .𝘮𝘦𝘯𝘶𝘩𝘰𝘵

⚙️ .𝙤𝙛𝙛 𝙢𝙤𝙙𝙤𝙝𝙤𝙧𝙣𝙮
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘪́𝘢 𝘲𝘶𝘦 𝘯𝘪𝘯𝘨𝘶́𝘯 𝘶𝘴𝘶𝘢𝘳𝘪𝘰 𝘶𝘴𝘦 𝘭𝘰𝘴 𝘤𝘰𝘮𝘢𝘯𝘥𝘰 +18.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ . 𝙤𝙣 𝙖𝙣𝙩𝙞𝙩𝙤𝙭𝙞𝙘𝙤𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘪́𝘢 𝘲𝘶𝘦 𝘯𝘪𝘯𝘨𝘶́𝘯 𝘶𝘴𝘶𝘢𝘳𝘪𝘰 𝘦𝘴𝘤𝘳𝘪𝘣𝘢 𝘱𝘢𝘭𝘢𝘣𝘳𝘢𝘴 𝘰𝘧𝘦𝘯𝘴𝘪𝘷𝘢𝘴, 𝘵𝘪𝘳𝘢𝘯𝘥𝘰 𝘢𝘥𝘷𝘦𝘳𝘵𝘦𝘯𝘤𝘪𝘢𝘴. ( 𝘢 𝘭𝘢 3 𝘢𝘥𝘷 𝘦𝘴𝘵𝘢́ 𝘧𝘶𝘦𝘳𝘢 𝘥𝘦𝘭 𝘨𝘳𝘶𝘱𝘰.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙩𝙤𝙭𝙞𝙘𝙤𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘵𝘰𝘥𝘰 𝘵𝘪𝘱𝘰 𝘥𝘦 𝘰𝘧𝘦𝘯𝘴𝘢𝘴 𝘲𝘶𝘦 𝘴𝘦 𝘩𝘢𝘨𝘢 𝘦𝘯 𝘦𝘭 𝘨𝘳𝘶𝘱𝘰 .
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙨𝙞𝙢𝙞𝙤𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘪́𝘢 𝘦𝘭 𝘪𝘯𝘨𝘳𝘦𝘴𝘰 𝘥𝘦 𝘯𝘶́𝘮𝘦𝘳𝘰𝘴 𝘢́𝘳𝘢𝘣𝘦𝘴 𝘺 𝘯𝘶́𝘮𝘦𝘳𝘰𝘴 𝘤𝘰𝘭𝘰𝘮𝘣𝘪𝘢𝘯𝘰𝘴.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙨𝙞𝙢𝙞𝙤𝙨
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘭 𝘪𝘯𝘨𝘳𝘦𝘴𝘰 𝘢 𝘵𝘰𝘥𝘰𝘴 𝘭𝘰𝘴 𝘯𝘶́𝘮𝘦𝘳𝘰𝘴 .
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙫𝙚𝙧
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘵𝘦 𝘮𝘰𝘴𝘵𝘳𝘢𝘳𝘢́ 𝘷𝘪𝘥𝘦𝘰𝘴 , 𝘪𝘮𝘢́𝘨𝘦𝘯𝘦𝘴 𝘲𝘶𝘦 𝘦𝘴𝘵𝘦́𝘯 𝘱𝘢𝘳𝘢 𝘷𝘦𝘳 1 𝘴𝘰𝘭𝘢 𝘷𝘦𝘻 .

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙫𝙚𝙧
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘵𝘦 𝘮𝘰𝘴𝘵𝘳𝘢𝘳𝘢́ 𝘷𝘪𝘥𝘦𝘰𝘴 , 𝘪𝘮𝘢́𝘨𝘦𝘯𝘦𝘴 𝘲𝘶𝘦 𝘦𝘴𝘵𝘦́𝘯 𝘱𝘢𝘳𝘢 𝘷𝘦𝘳 1 𝘴𝘰𝘭𝘢 𝘷𝘦𝘻 .
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙨𝙞𝙢𝙞
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘪𝘯𝘵𝘦𝘳𝘢𝘤𝘵𝘶𝘢𝘳𝘢 𝘤𝘰𝘯𝘵𝘪𝘨𝘰 𝘦𝘯 𝘧𝘰𝘳𝘮𝘢 𝘢𝘶𝘵𝘰𝘮𝘢́𝘵𝘪𝘤𝘢 

⚙️ .𝙤𝙛𝙛 𝙨𝙞𝙢𝙞
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘪𝘯𝘵𝘦𝘳𝘢𝘤𝘵𝘶𝘢𝘳𝘢 𝘤𝘰𝘯𝘵𝘪𝘨𝘰 .
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙚𝙣𝙡𝙖𝙘𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘯𝘪𝘯𝘨𝘶́𝘯 𝘭𝘪𝘯𝘬 𝘥𝘦 𝘰𝘵𝘳𝘰 𝘨𝘳𝘶𝘱𝘰 .

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙚𝙣𝙡𝙖𝙘𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘭𝘪𝘯𝘬𝘴 𝘥𝘦 𝘰𝘵𝘳𝘰𝘴 𝘨𝘳𝘶𝘱𝘰𝘴.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙩𝙞𝙠𝙩𝙤𝙠
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘵𝘪𝘬𝘵𝘰𝘬 .

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙩𝙞𝙠𝙩𝙤𝙠
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘵𝘪𝘬 𝘵𝘰𝘬.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙮𝙤𝙪𝙩𝙪𝙗𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘠𝘵.

⚙️ . 𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙮𝙤𝙪𝙩𝙪𝙗𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘠𝘵.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙩𝙚𝙡𝙚𝙜𝙧𝙖𝙢
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘵𝘦𝘭𝘦𝘨𝘳𝘢𝘮.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙩𝙚𝙡𝙚𝙜𝙧𝙖𝙢
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘵𝘦𝘭𝘦𝘨𝘳𝘢𝘮.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙛𝙖𝙘𝙚𝙗𝙤𝙤𝙠
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘧𝘣.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙛𝙖𝙘𝙚𝙗𝙤𝙤𝙠
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘧𝘣.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘪𝘎.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢 
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘪𝘎.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙩𝙬𝙞𝙩𝙩𝙚𝙧
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘵𝘸.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙩𝙬𝙞𝙩𝙩𝙚𝙧
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘦𝘯𝘭𝘢𝘤𝘦𝘴 𝘥𝘦 𝘵𝘸.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙚𝙣𝙡𝙖𝙘𝙚2
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘯𝘪𝘯𝘨𝘶́𝘯 𝘦𝘯𝘭𝘢𝘤𝘦.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙚𝙣𝙡𝙖𝙘𝙚2
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢́ 𝘵𝘰𝘥𝘰 𝘦𝘯𝘭𝘢𝘤𝘦.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙙𝙚𝙡𝙚𝙩𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘵𝘦 𝘮𝘰𝘴𝘵𝘳𝘢𝘳𝘢́ 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴 𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘥𝘰𝘴 𝘲𝘶𝘦 𝘴𝘦 𝘩𝘪𝘤𝘪𝘦𝘳𝘰𝘯 𝘦𝘯 𝘦𝘭 𝘨𝘳𝘶𝘱𝘰 .

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙙𝙚𝙡𝙚𝙩𝙚
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘵𝘦 𝘮𝘰𝘴𝘵𝘳𝘢𝘳𝘢́ 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴 𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘥𝘰𝘴 𝘲𝘶𝘦 𝘴𝘦 𝘩𝘪𝘤𝘪𝘦𝘳𝘰𝘯 𝘦𝘯 𝘦𝘭 𝘨𝘳𝘶𝘱𝘰 .
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙢𝙤𝙙𝙤𝙖𝙙𝙢𝙞𝙣
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘳𝘦𝘴𝘱𝘰𝘯𝘥𝘦𝘳𝘢́ 𝘴𝘰𝘭𝘰 𝘢 𝘢𝘥𝘮𝘪𝘯𝘪𝘴𝘵𝘳𝘢𝘥𝘰𝘳𝘦𝘴.

⚙️ .𝙤𝙛𝙛 𝙢𝙤𝙙𝙤𝙖𝙙𝙢𝙞𝙣
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘳𝘦𝘴𝘱𝘰𝘯𝘥𝘦𝘳𝘢́ 𝘢 𝘵𝘰𝘥𝘰𝘴 𝘥𝘦𝘭 𝘨𝘳𝘶𝘱𝘰.
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚙️ .𝙤𝙣 𝙖𝙣𝙩𝙞𝙨𝙥𝙖𝙢
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢 𝘲𝘶𝘦 𝘦𝘭 𝘶𝘴𝘶𝘢𝘳𝘪𝘰 𝘩𝘢𝘨𝘢 𝘴𝘱𝘢𝘮 𝘥𝘦 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴.

⚙️ .𝙤𝙛𝙛 𝙖𝙣𝙩𝙞𝙨𝙥𝙖𝙢
🔗 𝘊𝘰𝘯 𝘦𝘴𝘵𝘢 𝘧𝘶𝘯𝘤𝘪𝘰́𝘯 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 𝘯𝘰 𝘱𝘦𝘳𝘮𝘪𝘵𝘪𝘳𝘢 𝘲𝘶𝘦 𝘯𝘪𝘯𝘨𝘶́𝘯 𝘶𝘴𝘶𝘢𝘳𝘪𝘰 𝘩𝘢𝘨𝘢 𝘴𝘱𝘢𝘮 𝘥𝘦 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴.

𝙀́𝙇𝙄𝙏𝙀 𝘽𝙊𝙏 𝙂𝙇𝙊𝘽𝘼𝙇 






 `.trim()
    
const vi = ['https://telegra.ph/file/d1f49ab23be65f6d0859c.mp4']

try {
await conn.sendMessage(m.chat, { video: { url: vi.getRandom() }, gifPlayback: true, caption: menu, mentions: [m.sender, global.conn.user.jid] }, { quoted: fkontak }) 
} catch (error) {
try {
await conn.sendMessage(m.chat, { image: { url: gataMenu.getRandom() }, gifPlayback: false, caption: menu, mentions: [m.sender, global.conn.user.jid] }, { quoted: fkontak }) 
} catch (error) {
try {
await conn.sendMessage(m.chat, { image: gataImg.getRandom(), gifPlayback: false, caption: menu, mentions: [m.sender, global.conn.user.jid] }, { quoted: fkontak }) 
} catch (error) {
try{
await conn.sendFile(m.chat, imagen5, 'menu.jpg', menu, fkontak, false, { mentions: [m.sender, global.conn.user.jid] })
} catch (error) {
return 
}}}} 

} catch (e) {
await m.reply(lenguajeGB['smsMalError3']() + '\n*' + lenguajeGB.smsMensError1() + '*\n*' + usedPrefix + `${lenguajeGB.lenguaje() == 'es' ? 'reporte' : 'report'}` + '* ' + `${lenguajeGB.smsMensError2()} ` + usedPrefix + command)
console.log(`❗❗ ${lenguajeGB['smsMensError2']()} ${usedPrefix + command} ❗❗`)
console.log(e)}}

handler.command = /^(guia2|guía2)$/i
handler.register = false
handler.group = true
export default handler
    
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
