import translate from '@vitalets/google-translate-api';
import fetch from 'node-fetch';
const handler = async (m, {args, usedPrefix, command}) => {
  const msg = `⚠️ 𝙐𝙎𝙊 𝘾𝙊𝙍𝙍𝙀𝘾𝙏𝙊 𝘿𝙀𝙇 𝘾𝙊𝙈𝘼𝙉𝘿𝙊 𝙏𝙍𝘼𝘿𝙐𝘾𝙄𝙍. 
.𝘛𝘳𝘢𝘥𝘶𝘤𝘪𝘳 (𝘪𝘥𝘪𝘰𝘮𝘢) 𝘵𝘦𝘹𝘵𝘰)

𝙀𝙟𝙚𝙢𝙥𝙡𝙤:
.𝘵𝘳𝘢𝘥𝘶𝘤𝘪𝘳 𝘦𝘴 𝘩𝘦𝘭𝘭𝘰 
.𝘵𝘳𝘢𝘥𝘶𝘤𝘪𝘳 𝘦𝘯 𝘩𝘰𝘭𝘢 

🌍 𝙄𝙙𝙞𝙤𝙢𝙖𝙨:
𝘐𝘯𝘨𝘭𝘦́𝘴 = 𝘦𝘴 
𝘌𝘴𝘱𝘢𝘯̃𝘰𝘭 = 𝘦𝘯
𝘈𝘧𝘳𝘪𝘬𝘢́𝘢𝘯𝘴 = 𝘢𝘧
𝘈𝘭𝘣𝘢𝘯𝘦́𝘴 = 𝘴𝘲
𝘈𝘮𝘢́𝘳𝘪𝘤𝘰 = 𝘢𝘮
𝘈́𝘳𝘢𝘣𝘦	= 𝘢𝘳
𝘈𝘳𝘮𝘦𝘯𝘪𝘰 = 𝘩𝘺
𝘈𝘴𝘢𝘮𝘦́𝘴 =	𝘢𝘴
𝘈𝘪𝘮𝘢𝘳𝘢 = 𝘢𝘺
𝘈𝘻𝘦𝘳𝘣𝘢𝘪𝘺𝘢𝘯𝘰 = 𝘢𝘻
𝘉𝘢𝘮𝘣𝘢𝘳𝘢	= 𝘣𝘮
𝘝𝘢𝘴𝘤𝘰	= 𝘦𝘶
𝘉𝘪𝘦𝘭𝘰𝘳𝘳𝘶𝘴𝘰 =	𝘣𝘦
𝘉𝘦𝘯𝘨𝘢𝘭𝘪́ =	𝘣𝘯
𝘉𝘩𝘰𝘴𝘱𝘶𝘳𝘪	= 𝘣𝘩𝘰
𝘉𝘰𝘴𝘯𝘪𝘰 = 𝘣𝘴
𝘉𝘶́𝘭𝘨𝘢𝘳𝘰	= 𝘣𝘨
𝘊𝘢𝘵𝘢𝘭𝘢́𝘯	= 𝘤𝘢
𝘊𝘦𝘣𝘶𝘢𝘯𝘰	= 𝘤𝘦𝘣
𝘊𝘰𝘳𝘴𝘰	= 𝘤𝘰
𝘊𝘳𝘰𝘢𝘵𝘢 = 𝘩𝘳
𝘊𝘩𝘦𝘤𝘰	= 𝘤𝘴
𝘋𝘢𝘯𝘦́𝘴	= 𝘥𝘢
𝘋𝘩𝘪𝘷𝘦𝘩𝘪	= 𝘥𝘷
𝘋𝘰𝘨𝘳𝘪	= 𝘥𝘰𝘪
𝘏𝘰𝘭𝘢𝘯𝘥𝘦́𝘴	= 𝘯𝘭
𝘐𝘯𝘨𝘭𝘦́𝘴	= 𝘦𝘯
𝘌𝘴𝘱𝘦𝘳𝘢𝘯𝘵𝘰	= 𝘦𝘰
𝘌𝘴𝘵𝘰𝘯𝘪𝘰	= 𝘦𝘵
𝘌𝘸𝘦	= 𝘦𝘦
𝘍𝘪𝘭𝘪𝘱𝘪𝘯𝘰 = 𝘧𝘪𝘭
𝘍𝘪𝘯𝘦́𝘴	= 𝘧𝘪
𝘍𝘳𝘢𝘯𝘤𝘦́𝘴	= 𝘧𝘳
𝘍𝘳𝘪𝘴𝘰́𝘯	= 𝘧𝘺
𝘎𝘢𝘭𝘭𝘦𝘨𝘰	= 𝘨𝘭
𝘎𝘦𝘰𝘳𝘨𝘪𝘢𝘯𝘰	= 𝘬𝘢
𝘈𝘭𝘦𝘮𝘢́𝘯	= 𝘥𝘦
𝘎𝘳𝘪𝘦𝘨	= 𝘦𝘭
𝘎𝘶𝘢𝘳𝘢𝘯𝘪́	= 𝘨𝘯
𝘎𝘶𝘺𝘢𝘳𝘢𝘵𝘪́	= 𝘨𝘶
𝘊𝘳𝘪𝘰𝘭𝘭𝘰 𝘩𝘢𝘪𝘵𝘪𝘢𝘯𝘰	= 𝘩𝘵
𝘏𝘢𝘶𝘴𝘢	= 𝘩𝘢
𝘏𝘢𝘸𝘢𝘪𝘢𝘯𝘰	= 𝘩𝘢𝘸
𝘏𝘦𝘣𝘳𝘦𝘰	= 𝘩𝘦 𝘰 𝘪𝘸
𝘏𝘪𝘯𝘥𝘪	= 𝘩𝘪
𝘏𝘮𝘰𝘯𝘨	= 𝘩𝘮𝘯
𝘏𝘶́𝘯𝘨𝘢𝘳𝘰	= 𝘩𝘶
𝘐𝘴𝘭𝘢𝘯𝘥𝘦́𝘴	= 𝘪𝘴
𝘐𝘨𝘣𝘰	= 𝘪𝘨
𝘐𝘭𝘰𝘤𝘢𝘯𝘰	= 𝘪𝘭𝘰
𝘐𝘯𝘥𝘰𝘯𝘦𝘴𝘪𝘰	= 𝘪𝘥
𝘐𝘳𝘭𝘢𝘯𝘥𝘦́𝘴	= 𝘨𝘢
𝘐𝘵𝘢𝘭𝘪𝘢𝘯𝘰	= 𝘪𝘵
𝘑𝘢𝘱𝘰𝘯𝘦́𝘴	= 𝘫𝘢
𝘑𝘢𝘷𝘢𝘯𝘦́𝘴	= 𝘫𝘷 𝘰 𝘫𝘸
𝘊𝘢𝘯𝘢𝘳𝘦́𝘴	= 𝘬𝘯
𝘒𝘢𝘻𝘢𝘫𝘰	= 𝘬𝘬
𝘑𝘦𝘮𝘦𝘳	= 𝘬𝘮
𝘒𝘪𝘯̃𝘢𝘳𝘶𝘢𝘯𝘥𝘢	= 𝘳𝘸
𝘒𝘰𝘯𝘬𝘢𝘯𝘪	= 𝘨𝘰𝘮
𝘊𝘰𝘳𝘦𝘢𝘯	= 𝘬𝘰
𝘒𝘳𝘪𝘰	= 𝘬𝘳𝘪
𝘊𝘶𝘳𝘥𝘰	= 𝘬𝘶
𝘒𝘶𝘳𝘥𝘰	= 𝘤𝘬𝘣
𝘒𝘪𝘳𝘨	= 𝘬𝘺
𝘓𝘢𝘰𝘴𝘪𝘢𝘯𝘰	= 𝘭𝘰
𝘓𝘢𝘵𝘪́𝘯	= 𝘭𝘢
𝘓𝘦𝘵𝘰́𝘯	= 𝘭𝘷
𝘓𝘪𝘯𝘨𝘢𝘭𝘢	= 𝘭𝘯
𝘓𝘪𝘵𝘶𝘢𝘯𝘰	= 𝘭𝘵
𝘓𝘶𝘨𝘢𝘯𝘥𝘢	= 𝘭𝘨
𝘓𝘶𝘹𝘦𝘮𝘣𝘶𝘳𝘨𝘶𝘦́𝘴 = 𝘭𝘣
𝘔𝘢𝘤𝘦𝘥𝘰𝘯𝘪𝘰	= 𝘮𝘬
𝘔𝘢𝘪𝘵𝘩𝘪𝘭𝘪	= 𝘮𝘢𝘪
𝘔𝘢𝘭𝘨𝘢𝘤𝘩𝘦	= 𝘮𝘨
𝘔𝘢𝘭𝘢𝘺𝘰 = ms
𝘔𝘢𝘭𝘢𝘣𝘢𝘳	= 𝘮𝘭
𝘔𝘢𝘭𝘵𝘦́𝘴 = 𝘮𝘵
𝘔𝘢𝘰𝘳𝘪́	= 𝘮𝘪
𝘔𝘢𝘳𝘢𝘵𝘩𝘪	= 𝘮𝘳
𝘔𝘦𝘪𝘵𝘦𝘪𝘭𝘰𝘯 = 𝘮𝘯𝘪-𝘔𝘵𝘦𝘪
𝘔𝘪𝘻𝘰	= 𝘭𝘶𝘴
𝘔𝘰𝘯𝘨𝘰𝘭	= 𝘮𝘯
𝘉𝘪𝘳𝘮𝘢𝘯𝘰	= 𝘮𝘺
𝘕𝘦𝘱𝘢𝘭𝘪́	= 𝘯𝘦
𝘕𝘰𝘳𝘶𝘦𝘨𝘰	= 𝘯𝘰
𝘕𝘺𝘢𝘯𝘫𝘢 = 𝘯𝘺
𝘖𝘥𝘪𝘢 = 𝘰𝘳
𝘖𝘳𝘰𝘮𝘰	= 𝘰𝘮
𝘗𝘢𝘴𝘩𝘵𝘰= 𝘱𝘴
𝘗𝘦𝘳𝘴𝘢	= 𝘧𝘢
𝘗𝘦𝘳𝘴𝘢	= 𝘧𝘢
𝘗𝘰𝘭𝘢𝘤𝘰	= 𝘱𝘭
𝘗𝘰𝘳𝘵𝘶𝘨𝘶𝘦́𝘴 = 𝘱𝘵
𝘗𝘶𝘯𝘫𝘢𝘣𝘪	= 𝘱𝘢
𝘘𝘶𝘦𝘤𝘩𝘶𝘢	= 𝘲𝘶
𝘙𝘶𝘮𝘢𝘯𝘰	= 𝘳𝘰
𝘙𝘶𝘴𝘰 = 𝘳𝘶
𝘚𝘢𝘮𝘰𝘢𝘯𝘰	= 𝘴𝘮
𝘚𝘢́𝘯𝘴𝘤𝘳	= 𝘴𝘢
𝘎𝘢𝘦́𝘭𝘪𝘤𝘰 = 𝘨𝘥
𝘚𝘦𝘱𝘦𝘥𝘪 =
𝘚𝘦𝘳𝘣𝘪𝘰	= 𝘴𝘳
𝘚𝘦𝘴𝘰𝘵𝘰	= 𝘴𝘵
𝘚𝘩𝘰𝘯𝘢	= 𝘴𝘯
𝘚𝘪𝘯𝘥𝘩𝘪	= 𝘴𝘥 
𝘊𝘪𝘯𝘨𝘢𝘭𝘦́𝘴	= 𝘴𝘪
𝘌𝘴𝘭𝘰𝘷𝘢𝘤𝘰	= 𝘴𝘬
𝘌𝘴𝘭𝘰𝘷𝘦𝘯𝘰	= 𝘴𝘭
𝘚𝘰𝘮𝘢𝘭𝘪́	= 𝘴𝘰
𝘌𝘴𝘱𝘢𝘯̃𝘰𝘭	= 𝘦𝘴
𝘚𝘶𝘯𝘥𝘢𝘯𝘦́𝘴	= 𝘴𝘶
𝘚𝘶𝘢𝘫𝘪𝘭𝘪	= 𝘴𝘸
𝘚𝘶𝘦𝘤𝘰	= 𝘴𝘷
𝘛𝘢𝘨𝘢𝘭𝘰 (𝘧𝘪𝘭𝘪𝘱𝘪𝘯𝘰)	= 𝘵𝘭
𝘛𝘢𝘺𝘪𝘬𝘰	= 𝘵𝘨
𝘛𝘢𝘮𝘪𝘭 = 𝘵𝘢
𝘛𝘢́𝘳𝘵𝘢𝘳𝘰	= 𝘵𝘵
𝘛𝘦𝘭𝘶𝘨𝘶́	= 𝘵𝘦
𝘛𝘢𝘪𝘭𝘢𝘯𝘥𝘦́𝘴	= 𝘵𝘩
𝘛𝘪𝘨𝘳𝘪𝘯̃𝘢	= 𝘵𝘪
𝘛𝘴𝘰𝘯𝘨𝘢	= 𝘵𝘴
𝘛𝘶𝘳𝘤𝘰	= 𝘵𝘳
𝘛𝘶𝘳𝘤𝘰𝘮	= 𝘵𝘬
𝘛𝘸𝘪 (𝘈𝘬𝘢𝘯)	= 𝘢𝘬
𝘜𝘤𝘳𝘢𝘯𝘪𝘢𝘯𝘰 = 𝘶𝘬
𝘜𝘳𝘥𝘶 = 𝘶𝘳
𝘜𝘪𝘨𝘶𝘳 = 𝘶𝘨
𝘜𝘻𝘣𝘦𝘬𝘰 = 𝘶𝘻
𝘝𝘪𝘦𝘵𝘯𝘢𝘮𝘪𝘵𝘢 = 𝘷𝘪
𝘎𝘢𝘭𝘦́𝘴	= 𝘤𝘺
𝘟𝘩𝘰𝘴𝘢 = 𝘹𝘻
𝘠𝘪𝘥𝘥𝘪𝘴𝘩	= 𝘺𝘪
𝘠𝘰𝘳𝘶𝘣𝘢 =	𝘺𝘰
𝘡𝘶𝘭𝘶́ = 𝘻𝘶
`;
  
  
  
  if (!args || !args[0]) return m.reply(msg);
  let lang = args[0];
  let text = args.slice(1).join(' ');
  const defaultLang = 'es';
  if ((args[0] || '').length !== 2) {
    lang = defaultLang;
    text = args.join(' ');
  }
  if (!text && m.quoted && m.quoted.text) text = m.quoted.text;
  try {
    const result = await translate(`${text}`, {to: lang, autoCorrect: true});
    await m.reply('*Traducción:* ' + result.text);
  } catch {
    try {
      const lol = await fetch(`https://api.lolhuman.xyz/api/translate/auto/${lang}?apikey=${lolkeysapi}&text=${text}`);
      const loll = await lol.json();
      const result2 = loll.result.translated;
      await m.reply('*Traducción:* ' + result2);
    } catch {
      await m.reply('*[❗𝐈𝐍𝐅𝐎❗] ERROR, VUELVA A INTENTARLO*');
    }
  }
};
handler.command = /^(translate|traducir|trad)$/i;
export default handler;
